Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMR21_DFP/2.0.42/Microchip.SAMR21_DFP.pdsc
      <condition id="ATSAMR21G17A">
         <require Dvendor="Microchip:3" Dname="ATSAMR21G17A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMR21G16A">
         <require Dvendor="Microchip:3" Dname="ATSAMR21G16A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMR21E16A">
         <require Dvendor="Microchip:3" Dname="ATSAMR21E16A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMR21E17A">
         <require Dvendor="Microchip:3" Dname="ATSAMR21E17A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMR21E18A">
         <require Dvendor="Microchip:3" Dname="ATSAMR21E18A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMR21G18A">
         <require Dvendor="Microchip:3" Dname="ATSAMR21G18A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMR21E19A">
         <require Dvendor="Microchip:3" Dname="ATSAMR21E19A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
   </conditions>
   <components>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="2.0.0" condition="ATSAMR21G17A">
         <description>Headers and startup code for Microchip ATSAMR21G17A</description>
         <files>
            <file condition="C" category="include" name="include/"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_samr21g17a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_samr21g17a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/samr21g17a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/samr21g17a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_samr21g17a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_samr21g17a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_samr21g17a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_samr21g17a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/iar/samr21g17a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/iar/samr21g17a_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="2.0.0" condition="ATSAMR21G16A">
         <description>Headers and startup code for Microchip ATSAMR21G16A</description>
         <files>
            <file condition="C" category="include" name="include/"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_samr21g16a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_samr21g16a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/samr21g16a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/samr21g16a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_samr21g16a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_samr21g16a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_samr21g16a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_samr21g16a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/iar/samr21g16a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/iar/samr21g16a_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="2.0.0" condition="ATSAMR21E16A">
         <description>Headers and startup code for Microchip ATSAMR21E16A</description>
         <files>
            <file condition="C" category="include" name="include/"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_samr21e16a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_samr21e16a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/samr21e16a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/samr21e16a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_samr21e16a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_samr21e16a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_samr21e16a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_samr21e16a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/iar/samr21e16a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/iar/samr21e16a_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="2.0.0" condition="ATSAMR21E17A">
         <description>Headers and startup code for Microchip ATSAMR21E17A</description>
         <files>
            <file condition="C" category="include" name="include/"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_samr21e17a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_samr21e17a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/samr21e17a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/samr21e17a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_samr21e17a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_samr21e17a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_samr21e17a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_samr21e17a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/iar/samr21e17a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/iar/samr21e17a_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="2.0.0" condition="ATSAMR21E18A">
         <description>Headers and startup code for Microchip ATSAMR21E18A</description>
         <files>
            <file condition="C" category="include" name="include/"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_samr21e18a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_samr21e18a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/samr21e18a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/samr21e18a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_samr21e18a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_samr21e18a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_samr21e18a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_samr21e18a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/iar/samr21e18a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/iar/samr21e18a_sram.icf" attr="config"/>
         </files>
      </component>
