Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMR21_DFP/2.0.42/Microchip.SAMR21_DFP.pdsc
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="2.0.0" condition="ATSAMR21G18A">
         <description>Headers and startup code for Microchip ATSAMR21G18A</description>
         <files>
            <file condition="C" category="include" name="include/"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_samr21g18a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_samr21g18a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/samr21g18a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/samr21g18a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_samr21g18a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_samr21g18a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_samr21g18a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_samr21g18a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/iar/samr21g18a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/iar/samr21g18a_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="2.0.0" condition="ATSAMR21E19A">
         <description>Headers and startup code for Microchip ATSAMR21E19A</description>
         <files>
            <file condition="C" category="include" name="include/"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_samr21e19a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_samr21e19a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/samr21e19a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/samr21e19a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_samr21e19a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_samr21e19a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_samr21e19a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_samr21e19a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/iar/samr21e19a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/iar/samr21e19a_sram.icf" attr="config"/>
         </files>
      </component>
   </components>
</package>
